app/controllers/posts_controller.rb

  def index
    @authors = Author.all
    @posts = if !params[:author].blank?
               @posts = Post.by_author(params[:author])
             elsif !params[:date].blank?
               @posts = if params[:date] == 'Today'
                          Post.from_today
                        else
                          Post.old_news
                        end
             else
               Post.all
---
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')